package com.senlatest.task7;

import java.util.ArrayList;

/*
Есть набор предметов, задаётся заранее, предметы могут повторяться.
 Предмет имеет 2 параметра (обязательных, остальные на усмотрения, типа имя и т.д.),
 объём (целое значение) и ценность (целое значение). Предметы неделимы.
 Задаётся размер сейфа, параметром его объёма (целое значение).
Нужно написать программу, которая набивает сейф набором предметов,
 таким образом чтобы ценность этого набора была максимальной.

 */
public class Solution {

}